# Создаем исходный массив
a = [543, 23, 76, 110, 345, 876, 90, 21, 555, 456, 787, 9, 89, 999, 10001, 234, 45, 90, 456, 231, 245, 69, 876, 903,
       977, 334, 778, 333, 444, 55, 103]

# Находим количество элементов массива меньше 100 и не кратных 5
count = len([x for x in a if x < 100 and x % 5 != 0])

# Заменяем такие элементы на найденное количество
for i in range(len(a)):
    if a[i] < 100 and a[i] % 5 != 0:
        a[i] = count

# Выводим измененный массив
for element in a:
    print(element)

